hurrican/hurrican-acceptance-test/src/citrus/resources/templates/wholesaleorderoutbound/v2/WholesaleOrder/updateOrderRUEMPV.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:updateOrder
                xmlns:ns4="http://www.mnet.de/esb/cdm/SupplierPartner/WholesaleOrderService/v2/message"
                xmlns:ns2="http://www.mnet.de/esb/cdm/SupplierPartner/WholesaleOrderService/v2">
            <ns2:sendingCarrier>MNETH</ns2:sendingCarrier>
            <ns2:receivingCarrier>MNET</ns2:receivingCarrier>
            <ns2:version>4</ns2:version>
            <ns2:orderType>
                <geschaeftsfall>PV</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallArt>Endkundenanbieterwechsel</geschaeftsfallArt>
            </ns2:orderType>
            <ns2:message>
                <ns4:RUEM-PV>
                    <meldungsattribute>
                        <vertragsnummer>13</vertragsnummer>
                        <externeAuftragsnummer>123</externeAuftragsnummer>
                        <auftraggebernummer>4334</auftraggebernummer>
                        <vorabstimmungId>testVaId-123</vorabstimmungId>
                        <anschluss>
                            <lineId>DEU.234543</lineId>
                        </anschluss>
                        <abgebenderProvider>
                            <providername>MNETH</providername>
                            <zustimmungProviderwechsel>J</zustimmungProviderwechsel>
                        </abgebenderProvider>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0021</meldungscode>
                            <meldungstext>Antwort des abgebenden Provider</meldungstext>
                        </position>
                    </meldungspositionen>
                </ns4:RUEM-PV>
            </ns2:message>
        </ns2:updateOrder>
    </soap:Body>
</soap:Envelope>